# Titanic Data Cleaning & Preprocessing
## Step 1: Import Required Libraries

In [20]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## Step 2: Load Dataset

In [21]:
df = pd.read_csv("Titanic-Dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Step 3: Understanding the Data

In [22]:
df.shape

(891, 12)

In [23]:
df.info()
df.describe()

<class 'pandas.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    str
 4   Sex          891 non-null    str
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    str
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    str
 11  Embarked     889 non-null    str
dtypes: float64(2), int64(5), str(5)
memory usage: 83.7 KB

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Step 4: Checking Missing Values

In [24]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

# DATA CLEANING PART

## Step 5: Handling Missing Values

In [25]:
# Fill Age with median
df["Age"] = df["Age"].fillna(df["Age"].median())

# Drop Cabin column
#df = df.drop("Cabin", axis=1)

# Fill Embarked with mode
df["Embarked"] = df["Embarked"].fillna(df["Embarked"].mode()[0])

df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

## Step 6: Removing Duplicates

In [26]:
df.duplicated().sum()
df = df.drop_duplicates()

## Step 7: Dropping Unnecessary Columns

In [27]:
df = df.drop(["PassengerId", "Name", "Ticket"], axis=1)
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    male  22.0      1      0   7.2500   NaN        S
1         1       1  female  38.0      1      0  71.2833   C85        C
2         1       3  female  26.0      0      0   7.9250   NaN        S
3         1       1  female  35.0      1      0  53.1000  C123        S
4         0       3    male  35.0      0      0   8.0500   NaN        S

# DATA PREPROCESSING PART

## Step 8: Encoding Categorical Variables

In [28]:
# Encode Sex
df["Sex"] = df["Sex"].map({"male": 0, "female": 1})

# One-hot encode Embarked
df = pd.get_dummies(df, columns=["Embarked"], drop_first=True)

df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked_Q,Embarked_S
0,0,3,0,22.0,1,0,7.2500,NaN,False,True
1,1,1,1,38.0,1,0,71.2833,C85,False,False
2,1,3,1,26.0,0,0,7.9250,NaN,False,True
3,1,1,1,35.0,1,0,53.1000,C123,False,True
4,0,3,0,35.0,0,0,8.0500,NaN,False,True

## Step 9: Feature Scaling

In [29]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
df[["Age", "Fare"]] = scaler.fit_transform(df[["Age", "Fare"]])

df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked_Q,Embarked_S
0,0,3,0,-0.565736,1,0,-0.502445,NaN,False,True
1,1,1,1,0.663861,1,0,0.786845,C85,False,False
2,1,3,1,-0.258337,0,0,-0.488854,NaN,False,True
3,1,1,1,0.433312,1,0,0.420730,C123,False,True
4,0,3,0,0.433312,0,0,-0.486337,NaN,False,True

# MODEL READY DATA

## Step 10: Splitting Features and Target

In [30]:
X = df.drop("Survived", axis=1)
y = df["Survived"]

X.head()

   Pclass  Sex       Age  SibSp  Parch      Fare Cabin  Embarked_Q  Embarked_S
0       3    0 -0.565736      1      0 -0.502445   NaN       False        True
1       1    1  0.663861      1      0  0.786845   C85       False       False
2       3    1 -0.258337      0      0 -0.488854   NaN       False        True
3       1    1  0.433312      1      0  0.420730  C123       False        True
4       3    0  0.433312      0      0 -0.486337   NaN       False        True

In [31]:
df.to_csv("cleaned_titanic2.csv", index=False)